Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/lwip-network-interface-integration/source/cy_ethernetif.c
/*
 * Copyright 2022, Cypress Semiconductor Corporation (an Infineon company) or
 * an affiliate of Cypress Semiconductor Corporation.  All rights reserved.
 *
 * This software, including source code, documentation and related
 * materials ("Software") is owned by Cypress Semiconductor Corporation
 * or one of its affiliates ("Cypress") and is protected by and subject to
 * worldwide patent protection (United States and foreign),
 * United States copyright laws and international treaty provisions.
 * Therefore, you may use this Software only as provided in the license
 * agreement accompanying the software package from which you
 * obtained this Software ("EULA").
 * If no EULA applies, Cypress hereby grants you a personal, non-exclusive,
 * non-transferable license to copy, modify, and compile the Software
 * source code solely for use in connection with Cypress's
 * integrated circuit products.  Any reproduction, modification, translation,
 * compilation, or representation of this Software except as specified
 * above is prohibited without the express written permission of Cypress.
 *
 * Disclaimer: THIS SOFTWARE IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND,
 * EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, NONINFRINGEMENT, IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. Cypress
 * reserves the right to make changes to the Software without notice. Cypress
 * does not assume any liability arising out of the application or use of the
 * Software or any product or circuit described in the Software. Cypress does
 * not authorize its products for use in any products where a malfunction or
 * failure of the Cypress product may reasonably be expected to result in
 * significant property damage, injury or death ("High Risk Product"). By
 * including Cypress's product in a High Risk Product, the manufacturer
 * of such system or application assumes all risk of such use and in doing
 * so agrees to indemnify Cypress against all liability.
*/

#if defined(CYBSP_ETHERNET_CAPABLE)

#include <string.h>
#include <stdint.h>
#include "lwipopts.h"
#include "lwip/netif.h"
#include "lwip/netifapi.h"
#include "lwip/init.h"
#include "lwip/dhcp.h"
#include "lwip/etharp.h"
#include "lwip/tcpip.h"
#include "lwip/ethip6.h"
#include "lwip/igmp.h"
#include "lwip/nd6.h"
#include "netif/ethernet.h"
#include "lwip/prot/autoip.h"
#include "lwip/prot/dhcp.h"
#include "lwip/dns.h"
#include "lwip/inet_chksum.h"

#include "lwip/icmp.h"
#include "lwip/inet.h"
#include "lwip/netdb.h"

#include "cy_lwip_error.h"
#include "cy_lwip_dhcp_server.h"
#include "cy_network_mw_core.h"
#include "cy_result.h"
#include "cy_lwip_log.h"

#ifdef COMPONENT_CAT3
#include "xmc_gpio.h"
#include "xmc_eth_mac.h"
#include "xmc_eth_phy.h"
#include "cy_eth_config.h"
#include "cyabs_rtos.h"
#endif

#ifdef COMPONENT_CAT1
#include "cy_ecm.h"
#include "cy_internal.h"
#endif

/******************************************************
 *                      Macros
 ******************************************************/
/**
 * Suppress unused parameter warning
 */
#define UNUSED_PARAMETER(x) ( (void)(x) )

/**
 * Suppress unused variable warning
 */
#define UNUSED_VARIABLE(x) ( (void)(x) )

#define EAPOL_PACKET_TYPE                        0x888E

#define MULTICAST_IP_TO_MAC(ip)                  {   (uint8_t) 0x01,             \
                                                     (uint8_t) 0x00,             \
                                                     (uint8_t) 0x5e,             \
                                                     (uint8_t) ((ip)[1] & 0x7F), \
                                                     (uint8_t) (ip)[2],          \
                                                     (uint8_t) (ip)[3]           \
                                                 }
#define IPV6_MULTICAST_TO_MAC_PREFIX             (0x33)

#define MAX_AUTO_IP_RETRIES                      (5)

#define MAX_ETHERNET_PORT                        (2U)
#define ETH_INTERFACE_INDEX                      (2U)
#define MAX_ETH_FRAME_SIZE                       (1500U)
/* MAC address*/
#define MAC_ADDR0                                (0x00U)
#define MAC_ADDR1                                (0x03U)
#define MAC_ADDR2                                (0x19U)
#define MAC_ADDR3                                (0x45U)
#define MAC_ADDR4                                (0x00U)
#define MAC_ADDR5                                (0x00U)

#define MAC_ADDR                                 ((uint64_t)MAC_ADDR0 | \
                                                  ((uint64_t)MAC_ADDR1 << 8) | \
                                                  ((uint64_t)MAC_ADDR2 << 16) | \
                                                  ((uint64_t)MAC_ADDR3 << 24) | \
                                                  ((uint64_t)MAC_ADDR4 << 32) | \
                                                  ((uint64_t)MAC_ADDR5 << 40))

#define ETH_LWIP_0_PHY_ADDR                      (0)

#define ETH_LWIP_0_NUM_RX_BUF                    (4U)
#define ETH_LWIP_0_NUM_TX_BUF                    (4U)

/* Define those to better describe your network interface. */
#define IFNAME0                                  'e'
#define IFNAME1                                  'n'

/*Maximum retry iterations for phy auto-negotiation*/
#define ETH_LWIP_PHY_MAX_RETRIES                 0xfffffU

#define ETH_MIN_FRAME_SIZE                      (64)
#define ETH_MAX_FRAME_SIZE                      (1518)
#define ETH_FRAME_SIZE_FCS                      (4) // (This is constant value)
#define ETH_FRAME_SIZE_HEADER                   (14) // 6 bytes for destination address, 6 bytes for source address, 2 bytes for Type (This is constant.)

#ifdef COMPONENT_CAT3
#define CY_ETH_SIZE_MAX_FRAME                   (1500)

#define ETH_LWIP_0_CRS_DV  XMC_GPIO_PORT15, 9U
#define ETH_LWIP_0_RXER  XMC_GPIO_PORT2, 4U
#define ETH_LWIP_0_RXD0  XMC_GPIO_PORT2, 2U
#define ETH_LWIP_0_RXD1  XMC_GPIO_PORT2, 3U
#define ETH_LWIP_0_TXEN  XMC_GPIO_PORT2, 5U
#define ETH_LWIP_0_TXD0  XMC_GPIO_PORT2, 8U
#define ETH_LWIP_0_TXD1  XMC_GPIO_PORT2, 9U
#define ETH_LWIP_0_RMII_CLK  XMC_GPIO_PORT15, 8U
#define ETH_LWIP_0_MDC  XMC_GPIO_PORT2, 7U
#define ETH_LWIP_0_MDIO  XMC_GPIO_PORT2, 0U
#define ETH_LWIP_0_PIN_LIST_SIZE 10U

