Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/lwip-network-interface-integration/source/cy_ethernetif.c
#ifdef ENABLE_ECM_LOGS
    #define RX_STATUS_THREAD_STACK_SIZE         ((1024 * 1) + (1024 * 3)) /* Additional 3kb of stack is added for enabling the prints */
#else
    #define RX_STATUS_THREAD_STACK_SIZE         (1024)
#endif
#define RX_EVENT_THREAD_STACK_SIZE              (1024 * 4)
#define RX_EVENT_THREAD_PRIORITY                (CY_RTOS_PRIORITY_ABOVENORMAL)
#define RX_STATUS_THREAD_PRIORITY               (CY_RTOS_PRIORITY_BELOWNORMAL)
#endif

#ifdef COMPONENT_CAT1
#define TX_DATA_BUF_MAX                         CY_ETH_DEFINE_TOTAL_BD_PER_TXQUEUE
#define TX_SEMAPHORE_TIMEOUT_MS                 120000
#endif
/******************************************************
 *               Variable Definitions
 ******************************************************/
#ifdef COMPONENT_CAT1
/* PDL Driver requires the data to be 32 byte aligned */
CY_SECTION_SHAREDMEM
CY_ALIGN(32)
static   uint8_t                              data_buffer[TX_DATA_BUF_MAX][CY_ETH_SIZE_MAX_FRAME];
volatile uint8_t                              tx_free_buf_index;
static   uint8_t                              tx_buf_available;
extern   cy_semaphore_t                       tx_semaphore;
extern   cy_mutex_t                           tx_mutex;
extern   cy_worker_thread_info_t              cy_tx_worker_thread;
static   cy_network_activity_event_callback_t activity_callback = NULL;
extern   cy_network_interface_context         iface_context_database[CY_IFACE_MAX_HANDLE];
extern   cy_worker_thread_info_t              cy_rx_worker_thread;
extern   cy_queue_t                           rx_input_buffer_queue;
LWIP_MEMPOOL_DECLARE(RX_POOL, NO_OF_MEMPOOL_ELEMENTS, sizeof(my_custom_pbuf_t), "Zero-copy RX PBUF pool");
#endif

#ifdef COMPONENT_CAT3
static cy_semaphore_t           rx_semaphore = NULL;
static cy_thread_t              rx_event_thread = NULL;
static cy_thread_t              link_status_thread = NULL;

#if defined(__ICCARM__)
#pragma data_alignment=4
static XMC_ETH_MAC_DMA_DESC_t ETH_LWIP_0_rx_desc[ETH_LWIP_0_NUM_RX_BUF];
#pragma data_alignment=4
static XMC_ETH_MAC_DMA_DESC_t ETH_LWIP_0_tx_desc[ETH_LWIP_0_NUM_TX_BUF];
#pragma data_alignment=4
static uint8_t ETH_LWIP_0_rx_buf[ETH_LWIP_0_NUM_RX_BUF][XMC_ETH_MAC_BUF_SIZE];
#pragma data_alignment=4
static uint8_t ETH_LWIP_0_tx_buf[ETH_LWIP_0_NUM_TX_BUF][XMC_ETH_MAC_BUF_SIZE];
#elif defined(__CC_ARM)
static __attribute__((aligned(4))) XMC_ETH_MAC_DMA_DESC_t ETH_LWIP_0_rx_desc[ETH_LWIP_0_NUM_RX_BUF] __attribute__((section ("RW_IRAM1")));
static __attribute__((aligned(4))) XMC_ETH_MAC_DMA_DESC_t ETH_LWIP_0_tx_desc[ETH_LWIP_0_NUM_TX_BUF] __attribute__((section ("RW_IRAM1")));
static __attribute__((aligned(4))) uint8_t ETH_LWIP_0_rx_buf[ETH_LWIP_0_NUM_RX_BUF][XMC_ETH_MAC_BUF_SIZE] __attribute__((section ("RW_IRAM1")));
static __attribute__((aligned(4))) uint8_t ETH_LWIP_0_tx_buf[ETH_LWIP_0_NUM_TX_BUF][XMC_ETH_MAC_BUF_SIZE] __attribute__((section ("RW_IRAM1")));
#elif defined(__GNUC__)
static __attribute__((aligned(4))) XMC_ETH_MAC_DMA_DESC_t ETH_LWIP_0_rx_desc[ETH_LWIP_0_NUM_RX_BUF] __attribute__((section ("ETH_RAM")));
static __attribute__((aligned(4))) XMC_ETH_MAC_DMA_DESC_t ETH_LWIP_0_tx_desc[ETH_LWIP_0_NUM_TX_BUF] __attribute__((section ("ETH_RAM")));
static __attribute__((aligned(4))) uint8_t ETH_LWIP_0_rx_buf[ETH_LWIP_0_NUM_RX_BUF][XMC_ETH_MAC_BUF_SIZE] __attribute__((section ("ETH_RAM")));
static __attribute__((aligned(4))) uint8_t ETH_LWIP_0_tx_buf[ETH_LWIP_0_NUM_TX_BUF][XMC_ETH_MAC_BUF_SIZE] __attribute__((section ("ETH_RAM")));
#else
static __attribute__((aligned(4))) XMC_ETH_MAC_DMA_DESC_t ETH_LWIP_0_rx_desc[ETH_LWIP_0_NUM_RX_BUF];
static __attribute__((aligned(4))) XMC_ETH_MAC_DMA_DESC_t ETH_LWIP_0_tx_desc[ETH_LWIP_0_NUM_TX_BUF];
static __attribute__((aligned(4))) uint8_t ETH_LWIP_0_rx_buf[ETH_LWIP_0_NUM_RX_BUF][XMC_ETH_MAC_BUF_SIZE];
static __attribute__((aligned(4))) uint8_t ETH_LWIP_0_tx_buf[ETH_LWIP_0_NUM_TX_BUF][XMC_ETH_MAC_BUF_SIZE];
#endif

const XMC_ETH_PHY_CONFIG_t eth_phy_config =
{
    .interface = XMC_ETH_LINK_INTERFACE_RMII,
    .enable_auto_negotiate = true
};

XMC_ETH_MAC_t eth_mac =
{
    .regs = ETH0,
    .address = MAC_ADDR,
    .rx_desc = ETH_LWIP_0_rx_desc,
    .tx_desc = ETH_LWIP_0_tx_desc,
    .rx_buf = &ETH_LWIP_0_rx_buf[0][0],
    .tx_buf = &ETH_LWIP_0_tx_buf[0][0],
    .num_rx_buf = ETH_LWIP_0_NUM_RX_BUF,
    .num_tx_buf = ETH_LWIP_0_NUM_TX_BUF
};

static struct netif *xnetif = NULL;
#endif
/******************************************************
 *               Static Function Declarations
 ******************************************************/
#ifdef COMPONENT_CAT1
void cy_process_ethernet_data_cb(ETH_Type *eth_type, uint8_t * rx_buffer, uint32_t length);
void cy_notify_ethernet_rx_data_cb(ETH_Type *base, uint8_t **u8RxBuffer, uint32_t *u32Length);
void cy_tx_complete_cb ( ETH_Type *pstcEth, uint8_t u8QueueIndex );
void cy_tx_failure_cb ( ETH_Type *pstcEth, uint8_t u8QueueIndex );
#endif

static err_t ethif_output(struct netif *netif, struct pbuf *p);
err_t ethernetif_init(struct netif *netif);

#ifdef COMPONENT_CAT3
static void low_level_init(struct netif *netif);
static struct pbuf * low_level_input(void);
static void ethernetif_input(void *arg);

#if LWIP_NETIF_LINK_CALLBACK == 1
static void ethernetif_link_callback(struct netif *netif);
static void ethernetif_link_status(void *args);
#endif
#endif
/******************************************************
 *               Function Definitions
 ******************************************************/
#ifdef COMPONENT_CAT3
/*Weak function to be called in case of error*/
__WEAK void ETH_LWIP_Error (ETH_LWIP_ERROR_t error_code)
{
    switch (error_code)
    {
      case ETH_LWIP_ERROR_PHY_DEVICE_ID:
         /* Incorrect PHY address configured in the ETH_LWIP APP network interface.
          * Because the connect PHY does not match the configuration or the PHYADR is incorrect*/
         break;

     case ETH_LWIP_ERROR_PHY_TIMEOUT:
        /* PHY did not respond.*/
        break;

     case ETH_LWIP_ERROR_PHY_ERROR:
       /*PHY register update failed.*/
       break;

     default:
       break;
    }

