Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/lwip-network-interface-integration/source/cy_ethernetif.c
    for (;;);
}

#if LWIP_NETIF_LINK_CALLBACK == 1
static void ethernetif_link_callback(struct netif *netif)
{
    XMC_ETH_LINK_SPEED_t speed;
    XMC_ETH_LINK_DUPLEX_t duplex;
    bool phy_autoneg_state;
    uint32_t retries = 0U;
    int32_t status;

    if (netif_is_link_up(netif))
    {
        if((status = XMC_ETH_PHY_Init(&eth_mac, ETH_LWIP_0_PHY_ADDR, &eth_phy_config)) != XMC_ETH_PHY_STATUS_OK)
        {
            ETH_LWIP_Error((ETH_LWIP_ERROR_t)status);
        }

        /* If autonegotiation is enabled */
        do {
            phy_autoneg_state = XMC_ETH_PHY_IsAutonegotiationCompleted(&eth_mac, ETH_LWIP_0_PHY_ADDR);
            retries++;
        } while ((phy_autoneg_state == false) && (retries < ETH_LWIP_PHY_MAX_RETRIES));

        if(phy_autoneg_state == false)
        {
            ETH_LWIP_Error(ETH_LWIP_ERROR_PHY_TIMEOUT);
        }

        speed = XMC_ETH_PHY_GetLinkSpeed(&eth_mac, ETH_LWIP_0_PHY_ADDR);
        duplex = XMC_ETH_PHY_GetLinkDuplex(&eth_mac, ETH_LWIP_0_PHY_ADDR);

        XMC_ETH_MAC_SetLink(&eth_mac, speed, duplex);
        /* Enable Ethernet interrupts */
        XMC_ETH_MAC_EnableEvent(&eth_mac, (uint32_t)XMC_ETH_MAC_EVENT_RECEIVE);

        NVIC_SetPriority((IRQn_Type)108, NVIC_EncodePriority(NVIC_GetPriorityGrouping(), 62U, 0U));
        NVIC_ClearPendingIRQ((IRQn_Type)108);
        NVIC_EnableIRQ((IRQn_Type)108);
        XMC_ETH_MAC_EnableTx(&eth_mac);
        XMC_ETH_MAC_EnableRx(&eth_mac);

        netifapi_netif_set_up(xnetif);

    }
    else
    {
        /* Disable Ethernet interrupts */
        XMC_ETH_MAC_DisableEvent(&eth_mac, (uint32_t)XMC_ETH_MAC_EVENT_RECEIVE);
        NVIC_DisableIRQ((IRQn_Type)108);

        XMC_ETH_MAC_DisableTx(&eth_mac);
        XMC_ETH_MAC_DisableRx(&eth_mac);

        netifapi_netif_set_down(xnetif);

    }
}
#endif

static void ethernetif_link_status(void *args)
{
    UNUSED_PARAMETER(args);

    while(1)
    {
        if (XMC_ETH_PHY_GetLinkStatus(&eth_mac, ETH_LWIP_0_PHY_ADDR) == XMC_ETH_LINK_STATUS_DOWN)
        {
            if (netif_is_link_up(xnetif))
            {
                netif_set_link_down(xnetif);
            }
        }
        else
        {
             if (!netif_is_link_up(xnetif))
            {
                netif_set_link_up(xnetif);
            }
        }

        cy_rtos_delay_milliseconds( 1000 );
    }

}

/**
 * In this function, the hardware should be initialized.
 * Called from ethernetif_init().
 *
 * @param netif Already initialized lwIP network interface structure
 *        for this ethernetif
 */
static void low_level_init(struct netif *netif)
{
    UNUSED_PARAMETER(netif);

    XMC_ETH_MAC_PORT_CTRL_t port_control;
    XMC_GPIO_CONFIG_t gpio_config;
    gpio_config.output_level = XMC_GPIO_OUTPUT_LEVEL_LOW;
    gpio_config.mode = XMC_GPIO_MODE_INPUT_TRISTATE;

    XMC_GPIO_Init(ETH_LWIP_0_CRS_DV, &gpio_config);

    gpio_config.mode = XMC_GPIO_MODE_INPUT_TRISTATE;

    XMC_GPIO_Init(ETH_LWIP_0_RXER, &gpio_config);

    gpio_config.mode = XMC_GPIO_MODE_INPUT_TRISTATE;

    XMC_GPIO_Init(ETH_LWIP_0_RXD0, &gpio_config);

    gpio_config.mode = XMC_GPIO_MODE_INPUT_TRISTATE;

    XMC_GPIO_Init(ETH_LWIP_0_RXD1, &gpio_config);

    gpio_config.output_strength = XMC_GPIO_OUTPUT_STRENGTH_STRONG_SHARP_EDGE;
    gpio_config.mode = XMC_GPIO_MODE_OUTPUT_PUSH_PULL_ALT1;

    XMC_GPIO_Init(ETH_LWIP_0_TXEN, &gpio_config);

    gpio_config.output_strength = XMC_GPIO_OUTPUT_STRENGTH_STRONG_SHARP_EDGE;
    gpio_config.mode = XMC_GPIO_MODE_OUTPUT_PUSH_PULL_ALT1;

    XMC_GPIO_Init(ETH_LWIP_0_TXD0, &gpio_config);

    gpio_config.output_strength = XMC_GPIO_OUTPUT_STRENGTH_STRONG_SHARP_EDGE;
    gpio_config.mode = XMC_GPIO_MODE_OUTPUT_PUSH_PULL_ALT1;

    XMC_GPIO_Init(ETH_LWIP_0_TXD1, &gpio_config);

    gpio_config.mode = XMC_GPIO_MODE_INPUT_TRISTATE;

    XMC_GPIO_Init(ETH_LWIP_0_RMII_CLK, &gpio_config);

    gpio_config.output_strength = XMC_GPIO_OUTPUT_STRENGTH_STRONG_SHARP_EDGE;
    gpio_config.mode = XMC_GPIO_MODE_OUTPUT_PUSH_PULL_ALT1;

    XMC_GPIO_Init(ETH_LWIP_0_MDC, &gpio_config);

    gpio_config.mode = XMC_GPIO_MODE_INPUT_TRISTATE;

    XMC_GPIO_Init(ETH_LWIP_0_MDIO, &gpio_config);


    XMC_GPIO_SetHardwareControl(ETH_LWIP_0_MDIO, XMC_GPIO_HWCTRL_PERIPHERAL1);


    port_control.mode = XMC_ETH_MAC_PORT_CTRL_MODE_RMII;
    port_control.rxd0 = (XMC_ETH_MAC_PORT_CTRL_RXD0_t)0U;
    port_control.rxd1 = (XMC_ETH_MAC_PORT_CTRL_RXD1_t)0U;
    port_control.clk_rmii = (XMC_ETH_MAC_PORT_CTRL_CLK_RMII_t)2U;
    port_control.crs_dv = (XMC_ETH_MAC_PORT_CTRL_CRS_DV_t)2U;
    port_control.rxer = (XMC_ETH_MAC_PORT_CTRL_RXER_t)0U;
    port_control.mdio = (XMC_ETH_MAC_PORT_CTRL_MDIO_t)1U;
    XMC_ETH_MAC_SetPortControl(&eth_mac, port_control);


    (void)XMC_ETH_MAC_Init(&eth_mac);

    XMC_ETH_MAC_DisableJumboFrame(&eth_mac);

    XMC_ETH_MAC_EnableReceptionBroadcastFrames(&eth_mac);
}
#endif

#ifdef COMPONENT_CAT1
#if LWIP_IPV4 && LWIP_IGMP
/*
 * This function is used to respond to IGMP (group management) requests.
 */
static err_t igmp_eth_filter(struct netif *iface, const ip4_addr_t *group, enum netif_mac_filter_action action)
{
    cy_stc_ethif_filter_config_t filter_config;
    uint8_t mac_addr[CY_MAC_ADDR_LEN] = MULTICAST_IP_TO_MAC((uint8_t*)group);

    filter_config.typeFilter = CY_ETHIF_FILTER_TYPE_DESTINATION;
    filter_config.filterAddr.byte[0] = mac_addr[0];
    filter_config.filterAddr.byte[1] = mac_addr[1];
    filter_config.filterAddr.byte[2] = mac_addr[2];
    filter_config.filterAddr.byte[3] = mac_addr[3];
    filter_config.filterAddr.byte[4] = mac_addr[4];
    filter_config.filterAddr.byte[5] = mac_addr[5];
    filter_config.ignoreBytes        = 0x00;

    switch ( action )
    {
        case NETIF_ADD_MAC_FILTER:
            if (Cy_ETHIF_SetFilterAddress(ETH1, CY_ETHIF_FILTER_NUM_1, &filter_config) != CY_ETHIF_SUCCESS)
            {
                return ERR_VAL;
            }
            break;

        case NETIF_DEL_MAC_FILTER:
            memset((void *)&(filter_config.filterAddr.byte[0]), 0, CY_MAC_ADDR_LEN);
            if (Cy_ETHIF_SetFilterAddress(ETH1, CY_ETHIF_FILTER_NUM_1, &filter_config) != CY_ETHIF_SUCCESS)
            {
                return ERR_VAL;
            }
            break;

        default:
            return ERR_VAL;
    }

    return ERR_OK;
}
#endif

void custom_pbuf_free_cb(struct pbuf* p)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;

