Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/lwip-network-interface-integration/source/cy_ethernetif.c
    if(p == NULL)
    {
        return;
    }

    my_custom_pbuf_t* my_pbuf = (my_custom_pbuf_t*)p;
    result = cy_rtos_put_queue(&rx_input_buffer_queue, &my_pbuf->pbuffer, CY_RTOS_NEVER_TIMEOUT, false);
    if (CY_RSLT_SUCCESS != result)
    {
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Failed to push the free buffer to queue:[%d]\n", result);
    }

    LWIP_MEMPOOL_FREE(RX_POOL, my_pbuf);
}

static void rx_data_event_handler(void* arg)
{
    uint8_t *buffer = (uint8_t *)arg;
    cy_rx_buffer_info_t *rx_buffer_info;

    struct netif *netif = NULL;
    uint8_t i = 0;

    rx_buffer_info = (cy_rx_buffer_info_t *)buffer;
    cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Rx Buffer address from pool rx_buffer_info->rx_data_ptr:[%p] rx_buffer_info->length:[%d] rx_buffer_info->eth_idx:[%d]\n", rx_buffer_info->rx_data_ptr, rx_buffer_info->length, rx_buffer_info->eth_idx );

    for (i = 0; i < CY_IFACE_MAX_HANDLE; i++)
    {
        if( ( iface_context_database[i].is_initialized == true ) &&
            ( iface_context_database[i].iface_type == CY_NETWORK_ETH_INTERFACE ) &&
            ( iface_context_database[i].iface_idx == rx_buffer_info->eth_idx ) )
        {
            netif = (struct netif *)iface_context_database[i].nw_interface;
            break;
        }
    }

    if( i == CY_IFACE_MAX_HANDLE )
    {
        cy_rtos_put_queue(&rx_input_buffer_queue, &rx_buffer_info, CY_RTOS_NEVER_TIMEOUT, false);
        return;
    }

    my_custom_pbuf_t* my_pbuf  = (my_custom_pbuf_t*)LWIP_MEMPOOL_ALLOC(RX_POOL);
    if(my_pbuf == NULL)
    {
        cy_rtos_put_queue(&rx_input_buffer_queue, &rx_buffer_info, CY_RTOS_NEVER_TIMEOUT, false);
        return;
    }

    my_pbuf->pbuf_custom.custom_free_function = custom_pbuf_free_cb;
    my_pbuf->pbuffer = rx_buffer_info;

    struct pbuf* p = pbuf_alloced_custom(PBUF_RAW, rx_buffer_info->length,
                                         PBUF_REF,
                                         &my_pbuf->pbuf_custom,
                                         rx_buffer_info->rx_data_ptr,
                                         CY_ETH_SIZE_MAX_FRAME); /* Length size = payload + header size */

    if (p != NULL)
    {

        /* Call activity handler which is registered with the argument as false
        * indicating that there is RX packet.
        */
        if (activity_callback)
        {
            activity_callback(false);
        }

#ifdef ENABLE_CONNECTIVITY_MIDDLEWARE_LOGS
        size_t num_waiting;
        cy_rtos_count_queue(&rx_input_buffer_queue, &num_waiting);
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "the number of items currently in the queue:[%d]\n", num_waiting);
#endif
        /* Call netif->input */
        /* If the interface is not yet set up, drop the packet here. */
        if (netif->input == NULL || netif->input(p, netif) != ERR_OK)
        {
            cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Drop packet before lwip \n");
            (void)pbuf_free(p);
        }
    }
    else
    {
        cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "rx_data_event_handler: pbuf allocation failed\n");
        cy_rtos_put_queue(&rx_input_buffer_queue, &rx_buffer_info, CY_RTOS_NEVER_TIMEOUT, false);
    }
    cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): END \n", __FUNCTION__ );
}

void cy_process_ethernet_data_cb( ETH_Type *eth_type, uint8_t *rx_buffer, uint32_t length )
{
    cy_rx_buffer_info_t *rx_params;
    ETH_Type *base_reg = eth_type;

    if (!((length >= CY_ETH_SIZE_MIN_FRAME) && (length <= CY_ETH_SIZE_MAX_FRAME)))
    {
        /* Ethernet packet received with invalid Rx length */
        cy_rtos_put_queue(&rx_input_buffer_queue, rx_buffer, CY_RTOS_NEVER_TIMEOUT, true);
        cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Invalid Ethernet frame size. Push the rx_buffer back to the rx pool\n");
        return;
    }

    rx_params = (cy_rx_buffer_info_t *)(rx_buffer - sizeof(cy_rx_buffer_info_t));
    rx_params->rx_data_ptr = rx_buffer;

    if(base_reg == ETH1)
    {
        rx_params->eth_idx = 1;
    }
    else
    {
        rx_params->eth_idx = 0;
    }
    rx_params->length = length;

    if((cy_worker_thread_enqueue(&cy_rx_worker_thread, rx_data_event_handler, (void *)rx_params)) != CY_RSLT_SUCCESS)
    {
        /* ERROR : Failed to send Rx callback notification. */
        /* TODO: The rx_buffer to be freed? */
        cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_worker_thread_enqueue Failed\n");
        return;
    }
}

void cy_notify_ethernet_rx_data_cb(ETH_Type *base, uint8_t **u8RxBuffer, uint32_t *u32Length)
{
    uint8_t *pbuffer = NULL;
    cy_rx_buffer_info_t *params;

    if(cy_rtos_get_queue(&rx_input_buffer_queue, (void *)&pbuffer, CY_RTOS_NEVER_TIMEOUT, true) != CY_RSLT_SUCCESS)
    {
        /* Failed to get a free buffer from the queue. */
        *u8RxBuffer = NULL;
        *u32Length = 0;
        return;
    }

    params = (cy_rx_buffer_info_t *)pbuffer;
    params->rx_data_ptr = (uint8_t *)(pbuffer + sizeof(cy_rx_buffer_info_t));
    *u32Length = CY_ETH_SIZE_MAX_FRAME;
    *u8RxBuffer = params->rx_data_ptr;
    return;
}

static void tx_event_handler(void* arg)
{
    cy_rslt_t result;

    result = cy_rtos_get_mutex( &tx_mutex , CY_RTOS_NEVER_TIMEOUT);
    if(result != CY_RSLT_SUCCESS)
    {
        cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_rtos_get_mutex failed\n");
        return;
    }
    if(tx_buf_available == 0)
    {
        tx_buf_available++;
        cy_rtos_set_semaphore( &tx_semaphore, 1 );
    }
    else
    {
        tx_buf_available++;
    }
    result = cy_rtos_set_mutex( &tx_mutex );
    if(result != CY_RSLT_SUCCESS)
    {
        cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_rtos_set_mutex failed\n");
        return;
    }
}
void cy_tx_complete_cb ( ETH_Type *pstcEth, uint8_t u8QueueIndex )
{
    (void)pstcEth;
    (void)u8QueueIndex;
    
    /* Push the tx event into the worker queue */
    if((cy_worker_thread_enqueue(&cy_tx_worker_thread, tx_event_handler, NULL)) != CY_RSLT_SUCCESS)
    {
        return;
    }
}

void cy_tx_failure_cb ( ETH_Type *pstcEth, uint8_t u8QueueIndex )
{
    (void)pstcEth;
    (void)u8QueueIndex;
    
    /* Push the tx event into the worker queue */
    if((cy_worker_thread_enqueue(&cy_tx_worker_thread, tx_event_handler, NULL)) != CY_RSLT_SUCCESS)
    {
        return;
    }
}

#endif
/**
 * This function should do the actual transmission of the packet. The packet is
 * contained in the pbuf that is passed to the function. This pbuf
 * might be chained.
 *
 * @param netif The lwIP network interface structure for this ethernetif
 * @param p The MAC packet to send (e.g., IP packet including the MAC addresses and type)
 * @return ERR_OK if the packet could be sent;
 *         an err_t value if the packet couldn't be sent.
 *
 * @note Returning ERR_MEM here if a DMA queue of your MAC is full, which can lead to
 *       unexpected results. Consider waiting for space in the DMA queue
 *       to become available because the stack doesn't retry to send a packet
 *       dropped because of memory failure (except for the TCP timers).
 */
static err_t ethif_output(struct netif *netif, struct pbuf *p)
{
    struct pbuf *q;
    cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): START \n", __FUNCTION__ );

#ifdef COMPONENT_CAT3
    XMC_UNUSED_ARG(netif);
    uint8_t *buf;
    uint32_t framelen = 0U;

    if (p->tot_len > (u16_t)XMC_ETH_MAC_BUF_SIZE)
    {
        return ERR_BUF;
    }

    if (XMC_ETH_MAC_IsTxDescriptorOwnedByDma(&eth_mac))
    {
        XMC_ETH_MAC_ResumeTx(&eth_mac);
        return ERR_BUF;
    }
    else
    {
        buf = XMC_ETH_MAC_GetTxBuffer(&eth_mac);

