Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/lwip-network-interface-integration/source/cy_ethernetif.c
#if ETH_PAD_SIZE
        pbuf_header(p, -ETH_PAD_SIZE);    /* Drop the padding word. */
#endif

        for(q = p; q != NULL; q = q->next)
        {
            /* Send the data from the pbuf to the interface, one pbuf at a
            time. The size of the data in each pbuf is kept in the ->len
            variable. */
            MEMCPY(buf, q->payload, q->len);
            framelen += (uint32_t)q->len;
            buf += q->len;
        }

#if ETH_PAD_SIZE
        pbuf_header(p, ETH_PAD_SIZE);    /* Reclaim the padding word. */
#endif


        XMC_ETH_MAC_SetTxBufferSize(&eth_mac, framelen);

        XMC_ETH_MAC_ReturnTxDescriptor(&eth_mac);
        XMC_ETH_MAC_ResumeTx(&eth_mac);

        return ERR_OK;
    }
#endif

#ifdef COMPONENT_CAT1
    cy_network_interface_context *if_ctx;
    cy_en_ethif_status_t eth_status;
    uint32_t framelen=0;
    cy_rslt_t result;
    
    if_ctx = (cy_network_interface_context *)netif->state;

    if (p->tot_len > (u16_t)CY_ETH_SIZE_MAX_FRAME) 
    {
      return ERR_BUF;
    }

    /* Call activity handler which is registered with the argument as true
     * indicating there is TX packet.
     */
    if (activity_callback)
    {
        activity_callback(true);
    }

#if ETH_PAD_SIZE
    pbuf_header(p, -ETH_PAD_SIZE);    /* Drop the padding word. */
#endif

    if(tx_buf_available == 0)
    {
        result = cy_rtos_get_semaphore( &tx_semaphore, TX_SEMAPHORE_TIMEOUT_MS, false );
        if(result != CY_RSLT_SUCCESS)
        {
            cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "cy_rtos_get_semaphore failed\n");
            return ERR_TIMEOUT;
        }
    }
    for(q = p; q != NULL; q = q->next)
    {
        MEMCPY((data_buffer[tx_free_buf_index] + framelen), q->payload, q->len);
        framelen += (uint32_t)q->len;
    }

#if ETH_PAD_SIZE
    pbuf_header(p, ETH_PAD_SIZE);    /* Reclaim the padding word. */
#endif

    cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): Before Start transmitting frame p->tot_len:[%d] p->len:[%d] \n", __FUNCTION__, p->tot_len, p->len );

    if(if_ctx->iface_idx == (uint8_t)CY_ECM_INTERFACE_ETH1)
    {
        cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): Start transmitting frame ETH1 \n", __FUNCTION__ );
        eth_status = Cy_ETHIF_TransmitFrame(ETH1, (uint8_t*)data_buffer[tx_free_buf_index], framelen, CY_ETH_QS0_0, true);

        if(eth_status != CY_ETHIF_SUCCESS)
        {
            cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "failed to send outgoing packet :[%d]\n", eth_status);
        }
    }
    else
    {
        cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): Start transmitting frame ETH0 \n", __FUNCTION__ );
        eth_status = Cy_ETHIF_TransmitFrame(ETH0, (uint8_t*)data_buffer[tx_free_buf_index], framelen, CY_ETH_QS0_0, true);
        if(eth_status != CY_ETHIF_SUCCESS)
        {
            cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "failed to send outgoing packet :[%d]\n", eth_status);
        }
    }
    result = cy_rtos_get_mutex( &tx_mutex , CY_RTOS_NEVER_TIMEOUT);
    if(result != CY_RSLT_SUCCESS)
    {
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "cy_rtos_get_mutex failed\n");
        return ERR_IF;
    }
    /* Next data_buffer index to be used
     * Note: Tx completion callback is synchronous.
     */
    tx_free_buf_index = (tx_free_buf_index + 1) % TX_DATA_BUF_MAX;
    tx_buf_available--;
    result = cy_rtos_set_mutex( &tx_mutex );
    if(result != CY_RSLT_SUCCESS)
    {
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "cy_rtos_set_mutex failed\n");
    }
#endif

    cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): END \n", __FUNCTION__ );
    return ERR_OK ;
}

#ifdef COMPONENT_CAT3
/**
 * Should allocate a pbuf and transfer the bytes of the incoming
 * packet from the interface into the pbuf.
 *
 * @param netif The lwIP network interface structure for this ethernetif
 * @return A pbuf filled with the received packet (including MAC header);
 *         NULL on memory error
 */
static struct pbuf * low_level_input(void)
{

    struct pbuf *p = NULL;
    struct pbuf *q;
    uint32_t len;
    uint8_t *buffer;

    if (XMC_ETH_MAC_IsRxDescriptorOwnedByDma(&eth_mac) == false)
    {
        len = XMC_ETH_MAC_GetRxFrameSize(&eth_mac);

        if ((len > 0U) && (len <= (uint32_t)XMC_ETH_MAC_BUF_SIZE))
        {
#if ETH_PAD_SIZE
            len += ETH_PAD_SIZE;    /* Allow room for Ethernet padding. */
#endif

            /* Allocate a pbuf chain of pbufs from the pool. */
            p = pbuf_alloc(PBUF_RAW, (u16_t)len, PBUF_POOL);

            if (p != NULL)
            {
#if ETH_PAD_SIZE
                pbuf_header(p, -ETH_PAD_SIZE);  /* Drop the padding word. */
#endif

                buffer = XMC_ETH_MAC_GetRxBuffer(&eth_mac);

                len = 0U;
                /* Iterate over the pbuf chain until the entire
                 * packet is read into the pbuf. */
                for (q = p; q != NULL; q = q->next)
                {
                /* Read enough bytes to fill this pbuf in the chain. The
                 * available data in the pbuf is given by the q->len
                 * variable.
                 * This does not necessarily have to be a memcpy; you can also preallocate
                 * pbufs for a DMA-enabled MAC and after receiving truncate it to the
                 * actually received size. In this case, ensure the tot_len member of the
                 * pbuf is the sum of the chained pbuf len members.
                 */
                     MEMCPY(q->payload, &buffer[len], q->len);
                     len += q->len;
                }
#if ETH_PAD_SIZE
                pbuf_header(p, ETH_PAD_SIZE);    /* Reclaim the padding word. */
#endif

                XMC_ETH_MAC_ReturnRxDescriptor(&eth_mac);
            }
        }
        else
        {
            XMC_ETH_MAC_ReturnRxDescriptor(&eth_mac);
        }
    }

    XMC_ETH_MAC_ResumeRx(&eth_mac);

  return p;
}

/**
 * This function should be called when a packet is ready to be read
 * from the interface. It uses the function low_level_input() that
 * should handle the actual reception of bytes from the network
 * interface. Then the type of the received packet is determined and
 * the appropriate input function is called.
 *
 * @param netif The lwIP network interface structure for this ethernetif.
 */
static void ethernetif_input(void *arg)
{
    struct pbuf *p = NULL;
    struct eth_hdr *ethhdr;
    struct netif *netif = (struct netif *)arg;
    bool is_from_isr = false;

    cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s():%d netif:[%p]\n", __func__, __LINE__, netif);

    while(1)
    {
        cy_rtos_get_semaphore( &rx_semaphore, CY_RTOS_NEVER_TIMEOUT, is_from_isr );

        /* Receive data from RX descriptor, post data to queue, enable IRQ. */
        NVIC_DisableIRQ((IRQn_Type)108);

