Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/lwip-network-interface-integration/source/cy_ethernetif.c
        p = low_level_input();

        while (p != NULL)
        {
            ethhdr = p->payload;
            switch (htons(ethhdr->type))
            {
                case ETHTYPE_IP:
                case ETHTYPE_ARP:
                    /* Full packet send to tcpip_thread to process. */
                    if (netif->input( p, netif) != ERR_OK)
                    {
                        pbuf_free(p);
                    }

                    break;

                default:
                    pbuf_free(p);
                    break;
            }

            p = low_level_input();
        }

        NVIC_ClearPendingIRQ((IRQn_Type)108);
        NVIC_EnableIRQ((IRQn_Type)108);

    }

}
#endif

/**
 * Should be called at the beginning of the program to set up the
 * network interface.
 *
 * This function should be passed as a parameter to netif_add().
 *
 * @param netif The lwIP network interface structure for this ethernetif.
 * @return ERR_OK if the loopif is initialized;
 *         ERR_MEM if private data couldn't be allocated
 *         any other err_t on error.
 */
err_t ethernetif_init(struct netif* netif)
{
    LWIP_ASSERT("netif != NULL", (netif != NULL));
    cy_network_interface_context *if_ctx = (cy_network_interface_context *)netif->state;

    cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): START \n", __FUNCTION__ );

    /* Initialize the RX POOL */
    LWIP_MEMPOOL_INIT(RX_POOL);
    /* Initialise the buffer index */
    tx_free_buf_index = 0;
    /* Set the maximum buffers available initially */
    tx_buf_available = TX_DATA_BUF_MAX;

    /* Set the MAC hardware address to the interface.*/
    for(int i=0; i<ETH_HWADDR_LEN; i++)
    {
        netif->hwaddr[i] =  (u8_t)if_ctx->mac_address[i];
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "netif->hwaddr[%d]:[0x%x] \n", i, netif->hwaddr[i]);
    }

    netif->hwaddr_len = ETH_HWADDR_LEN;

    /* Maximum transfer unit */
    netif->mtu = CY_ETH_SIZE_MAX_FRAME;

    netif->name[0] = IFNAME0;
    netif->name[1] = IFNAME1;

#if LWIP_IPV4
    netif->output = etharp_output;
#endif
    netif->linkoutput = ethif_output;

    /*
     * Set up the information associated with sending the packets.
     */
    netif->flags = NETIF_FLAG_ETHARP;

#if ETH_BROADCAST_EN == 1
    netif->flags |= NETIF_FLAG_BROADCAST;
#endif

#ifdef LWIP_IPV6_MLD
    netif->flags |= NETIF_FLAG_MLD6;
#endif

#ifdef COMPONENT_CAT1
#if LWIP_IPV4 && LWIP_IGMP
    netif->flags |= NETIF_FLAG_IGMP;
    netif_set_igmp_mac_filter(netif, igmp_eth_filter) ;
#endif
#endif

#if LWIP_IPV6 == 1
    /*
     * Filter output packets for IPV6 through the Ethernet output
     * function for IPv6.
     */
    netif->output_ip6 = ethip6_output ;

    /*
     * Automatically generate a unicast IP address based on
     * neighbor discovery.
     */
    netif->ip6_autoconfig_enabled = 1 ;

    /*
     * Create a link-local IPv6 address.
     */
    netif_create_ip6_linklocal_address(netif, 1);

#if LWIP_IPV6_MLD
    /*
     * Register MLD MAC filter callback function that will be called by lwIP to add or delete an
     * entry in the IPv6 multicast filter table of the Ethernet MAC.
     */
    netif_set_mld_mac_filter(netif, NULL);
#endif
#endif

#ifdef COMPONENT_CAT3
    cy_rslt_t result = CY_RSLT_SUCCESS;
    ETH_LWIP_t *eth_lwip = if_ctx->hw_interface;

    /* Copy the netif address, which will be used for other netif operations */
    xnetif = netif;
    cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG,"assigned netif address: [%p]\n", xnetif);

    /* initialize the hardware */
    low_level_init(netif);

    result = cy_rtos_init_semaphore( &rx_semaphore, 1, 0);
    if( result != CY_RSLT_SUCCESS )
    {
        cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\n cy_rtos_init_semaphore failed with Error : [0x%X]\n", (unsigned int)result );
        return ERR_IF;
    }

    /* Create the thread to handle receive data events */
    result = cy_rtos_create_thread( &rx_event_thread, ethernetif_input, "eth_rx_input_thread", NULL,
                                    RX_EVENT_THREAD_STACK_SIZE, RX_EVENT_THREAD_PRIORITY, netif );
    if( result != CY_RSLT_SUCCESS )
    {
        cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_rtos_create_thread failed with Error : [0x%X]\n", (unsigned int)result );
        cy_rtos_deinit_semaphore( &rx_semaphore);
        return ERR_IF;
    }

#if LWIP_NETIF_LINK_CALLBACK == 1
    netif_set_link_callback(netif, ethernetif_link_callback);
#endif

    /*Create a thread to keep track of PHY link status */
    result = cy_rtos_create_thread( &link_status_thread, ethernetif_link_status, "phy_link_status_thread", NULL,
                                    RX_STATUS_THREAD_STACK_SIZE, RX_STATUS_THREAD_PRIORITY, netif );
    if( result != CY_RSLT_SUCCESS )
    {
        cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_rtos_create_thread failed with Error : [0x%X]\n", (unsigned int)result );
        /* Delete the rx_event_thread thread */
        cy_rtos_terminate_thread( &rx_event_thread );
        cy_rtos_join_thread( &rx_event_thread );

        /* De Initialize the semaphore */
        cy_rtos_deinit_semaphore( &rx_semaphore);
        return ERR_IF;
    }

    cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "initialized:%d\n", eth_lwip->initialized );

    eth_lwip->eth_mac = &eth_mac;
    eth_lwip->xnetif = xnetif;
    eth_lwip->initialized = true;
#endif

    cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): END \n", __FUNCTION__ );
    return ERR_OK;
}

#ifdef COMPONENT_CAT3
__WEAK void ETH_LWIP_UserIRQ(void)
{
}

void IRQ_Hdlr_108(void)
{
    XMC_ETH_MAC_ClearEventStatus(&eth_mac, XMC_ETH_MAC_EVENT_RECEIVE);
    cy_rtos_set_semaphore( &rx_semaphore, 1 );

    ETH_LWIP_UserIRQ();
}

void ETH_LWIP_Poll(void)
{
    cy_rtos_set_semaphore( &rx_semaphore, 1 );
}

#endif
#endif

